Revit 2027 API
LineLightShape Constructor
 Creates a line light shape object with 2.0' emit length.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LineLightShape()
Public Sub New
public:
LineLightShape()
new : unit -> LineLightShape
See Also
Reference
LineLightShape Class
LineLightShape Overload
Autodesk.Revit.DB.Lighting Namespace